app/controllers/admin_controller.rb

  def index
    @teachers = User.all(:conditions => "role = 'teacher'")
---
SELECT * FROM `users` WHERE (role = 'teacher')

  def create_teacher
    @teacher = User.new(params[:teacher].merge(:role => "teacher") )
    success = @teacher && @teacher.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `role`, `remember_token`, `login`, `email`) VALUES('Mikhail Filippov', 'e71e195396b804774b84317b693b500b832c0dec', '2010-01-31 12:21:49', 'bfb58305f968c6478cbfff09fbeb959468c1e51d', NULL, '2010-01-31 12:21:49', NULL, NULL, 'mikfil', 'mikfil@rambler.ru')

  def edit_teacher
    @teacher = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def update_teacher
    @teacher = User.find(params[:id])
    if @teacher.update_attributes(params[:teacher])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-01-31 12:31:49', `crypted_password` = '871aa1d9e464ceb50196b95995eb8cf78da4c419', `name` = 'Mikhail Filippov' WHERE `id` = 3

  def delete_teacher
    @teacher = User.find(params[:id])
    @teacher.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 4