app/controllers/subjects_controller.rb

SELECT * FROM `subjects` WHERE (`subjects`.teacher_id = 2)
---
  def dashboard
    @subjects = @teacher.subjects.all

SELECT * FROM `subjects` WHERE (`subjects`.teacher_id = 2)
---
  def index
    @subjects = @teacher.subjects.all

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1 AND (`subjects`.teacher_id = 2))
---
  def show
    @subject = @teacher.subjects.find_by_id(params[:id])

SELECT * FROM `subjects` WHERE (`subjects`.`id` = '1') AND (`subjects`.teacher_id = 2) LIMIT 1
---
  def edit
    @subject = current_user.subjects.find_by_id(params[:id])

INSERT INTO `subjects` (`created_at`, `title`, `updated_at`, `teacher_id`) VALUES('2010-01-31 13:52:32', 'math', '2010-01-31 13:52:32', 2)
---
  def create
    @subject = current_user.subjects.new(params[:subject])

    if @subject.save

SELECT * FROM `subjects` WHERE (`subjects`.`id` = '1') AND (`subjects`.teacher_id = 2) LIMIT 1
UPDATE `subjects` SET `updated_at` = '2010-01-31 14:06:02', `title` = '2math' WHERE `id` = 2
---
  def update
    @subject = current_user.subjects.find_by_id(params[:id])

    if @subject.update_attributes(params[:subject])

SELECT * FROM `subjects` WHERE (`subjects`.`id` = '9') AND (`subjects`.teacher_id = 2) LIMIT 1
DELETE FROM `subjects` WHERE `id` = 3
---
  def destroy
    @subject = current_user.subjects.find_by_id(params[:id])
    @subject.destroy