app/controllers/tests_controller.rb

  def dashboard
    @tests = @subject.tests.all
---
SELECT * FROM `tests` WHERE (`tests`.subject_id = 1)

  def index
    @tests = @subject.tests.all
---
SELECT * FROM `tests` WHERE (`tests`.subject_id = 1)

  def before_pass
    @test = @subject.tests.find_by_id(params[:id])
    if request.post?
      @student_name = params[:test][:student_name]
      @student_class = params[:test][:student_class]
      if @test.authenticate(params[:test][:test_password]) && !@student_name.blank? && !@student_class.blank?
        session["test#{@test.id}"] = @test.crypted_password
        session[:student_class] = @student_class
        student = User.find_or_create @student_name
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '2') AND (`tests`.subject_id = 1) LIMIT 1
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `role`, `remember_token`, `login`, `email`) VALUES('Nikita Filippov', '97adb9b6029599d56dabc75f241f7360b19969f0', '2010-02-02 09:44:14', '36cc8d2a192dac2428dc66b426e5a910c838e114', NULL, '2010-02-02 09:44:14', 0, NULL, '1bdcd18f21aab4a4a3459ef7475068b95198f9f5', 'fake@email.com')
SELECT * FROM `users` WHERE (`users`.`name` = 'Nikita Filippov') LIMIT 1

  def pass
    @test = @subject.tests.find_by_id(params[:id])
    if_student_enters_access_psw? @test do
      @qnumber = params[:q].to_i || 0
      @answer_id = params[:answer]
      @test = @subject.tests.find_by_id(params[:id])
      @qnumber = @test.questions.count - 1 if @qnumber >= @test.questions.count
      @question = @test.questions.all[@qnumber]
      @answer = @question.answers.find_by_id(@answer_id) if @answer_id
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '2') AND (`tests`.subject_id = 1) LIMIT 1
SELECT count(*) AS count_all FROM `questions` WHERE (`questions`.test_id = 2)
SELECT * FROM `questions` WHERE (`questions`.test_id = 2)
SELECT * FROM `answers` WHERE (`answers`.`id` = '6') AND (`answers`.question_id = 3) LIMIT 1

  def result
    @test = @subject.tests.find_by_id(params[:id])
    @result = TestResult.find_by_user_id_and_test_id(current_user.id, @test.id)
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '2') AND (`tests`.subject_id = 1) LIMIT 1
SELECT * FROM `test_results` WHERE (`test_results`.`user_id` = 2 AND `test_results`.`test_id` = 2) LIMIT 1

  def results
    @test = @subject.tests.find_by_id(params[:id])
    @classes = TestResult.all(:conditions => ["test_id = ?",@test.id], :group => "student_class").map { |tr| tr.student_class }
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '2') AND (`tests`.subject_id = 1) LIMIT 1
SELECT * FROM `test_results` WHERE (test_id = 2) GROUP BY student_class

  def class_results
    @classes = ["WD345", "WF3345"]
    @test = @subject.tests.find_by_id(params[:id])
    @results = TestResult.all(:conditions => ["test_id = ? and student_class = ?", @test.id, params[:class]])
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '2') AND (`tests`.subject_id = 1) LIMIT 1
SELECT * FROM `test_results` WHERE (test_id = 2 and student_class = 'WSDF200934566')

  def edit
    @test = @subject.tests.find_by_id(params[:id])
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '2') AND (`tests`.subject_id = 1) LIMIT 1

  def create
    @test = @subject.tests.new(params[:test])
    if @test.save
---
INSERT INTO `tests` (`salt`, `created_at`, `title`, `crypted_password`, `updated_at`, `subject_id`) VALUES('adbce9431f64a62234ba9684e42d6ef349ea9207', '2010-02-02 09:13:31', NULL, 'd397a1088f2904831a1fa1667aaba2abe7ee3de9', '2010-02-02 09:13:31', 1)

  def update
    @test = @subject.tests.find_by_id(params[:id])
    if @test.update_attributes(params[:test])
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '2') AND (`tests`.subject_id = 1) LIMIT 1
UPDATE `tests` SET `updated_at` = '2010-02-02 09:11:52', `crypted_password` = 'ce432962f5e6e51ab9000c317e09d78588e602e4' WHERE `id` = 2

  def destroy
    @test = Test.find_by_id(params[:id])
    @test.destroy
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '3') LIMIT 1
DELETE FROM `tests` WHERE `id` = 3