app/controllers/tests_controller.rb

  def show
    @test = @subject.tests.find_by_id(params[:id])
---
SELECT * FROM `tests` WHERE (`tests`.`id` = '2') AND (`tests`.subject_id = 1) LIMIT 1