app/controllers/welcome_controller.rb

  def index
    @teachers = User.all(:conditions => ["role = ?", Role::TEACHER])
---
SELECT * FROM `users` WHERE (role = 1)